use studio;

insert into 
clients (surnamecl, namecl, middlenamecl, dateOfBirthcl, gendercl, phonecl) values 
('Иванова', 'Мария', 'Сергеевна', '1992.12.01','ж','89312388911'),
('Морозова', 'Виолетта', 'Юрьевна', '1995.07.16','ж','8905623911'),
('Смирнова', 'Валерия', 'Сергеевна', '1994.12.12','ж','89367888988'),
('Соколова', 'Валентина', 'Николаевна', '1982.03.15','ж','89315558911'),
('Торопова', 'Ольга', 'Сергеевна', '1995.04.25','ж','89312356789'),
('Михайлова', 'Виктория', 'Александровна', '1992.12.01','ж','89312388911'),
('Соловьёв', 'Вячеслав', 'Викторович', '1986.09.27','м','89312388911'),
('Грищенко', 'Андрей', 'Алексеевич', '1975.08.01','м','89234889101'),
('Грищенко', 'Людмила', 'Михайловна', '1978.06.24','ж','89312376234'),
('Туренко', 'Анастасия', 'Алексеевна', '1995.09.26','ж','89312367891'),
('Клюшина', 'Светлана', 'Владимировна', '1968.02.01','ж','8931563211');


insert into
abonement (typeOfTrainings, numOfTrainings, priceab, nameab) values
('групповые', '1', '200', 'Разовое занятие(группа)'),
('персональные', '1', '500', 'Разовое занятие(персональная)'),
('мини группа', '1', '500', 'Разовое занятие(мини группа)');

insert into
abonement (typeOfTrainings, numOfTrainings, numActiveDays, priceab, nameab) values
('групповые', '8', '30', '1100', 'Новичок группа 8'),
('групповые', '8', '30', '1300', 'Группа 8'),
('групповые', '12', '30', '1800', 'Группа 12'),
('групповые', '20', '30', '2200', 'Группа 20');

insert into
abonement (typeOfTrainings, numOfTrainings, numActiveDays, priceab, sale, nameab) values
('персональные', '8', '30', '3000', '1300', 'Персональная 8'),
('персональные', '12', '30', '4000', '2400','Персональная 12'),
('мини группа', '8', '30', '3000', '1800', 'Мини группа 8'),
('мини группа', '12', '30', '4000', '3400','Мини группа 12');

insert into
style (namest) values
('Bellydance'),
('Йога 23'),
('-10 кг'),
('2 В 1: стройная и гибкая'),
('Секрет стройности*'),
('Пляжное тело'),
('Гибкость*'),
('Стрип пластика/go-go');

insert into
staff (surnamest, namest, genderst, phonest, passportst) values
('Норова', 'Татьяна', 'ж', '89236783456', '1324673845'),
('Дым', 'Маргарита', 'ж', '89237823354', '9083112663'),
('Богданова', 'Лолита', 'ж', '8921453345', '1909662156'),
('Петров', 'Иван', 'м', '89236783998', '1326756745');


insert into
timeoftrain (start, end) values
('17:00','18:00'),
('18:00','19:00'),
('19:00','20:00'),
('20:00','21:00'),
('21:00','22:00'),
('22:00','23:00');


insert into 
trainings(typeoftrain, idStyle, idCoach) values
('групповые','1','1'),
('групповые','4','2'),
('групповые','5','2'),
('групповые','7','2'),
('групповые','8','2'),
('групповые','3','3'),
('групповые','6','3'),
('групповые','2','4');


insert into 
timetable (dayOfWeek, idTime, idTrain) values
('Mon','1','1'),
('Mon','2','2'),
('Mon','5','6'),
('Mon','6','5'),
('Wed','1','8'),
('Wed','2','3'),
('Wed','3','4'),
('Wed','4','7'),
('Wed','5','6'),
('Wed','6','5'),
('Fri','1','8'),
('Fri','2','3'),
('Fri','3','4'),
('Fri','4','7'),
('Fri','5','6'),
('Fri','6','5');

insert into 
abonementofclient (idclient, idabonement, firstdate) values
('1','4','2015.11.10'),
('2','4','2015.10.9'),
('3','4','2015.10.28'),
('4','4','2015.11.25'),
('5','5','2015.11.10'),
('6','5','2015.11.25'),
('7','5','2015.11.10'),
('8','5','2015.11.25'),
('9','6','2015.11.10'),
('2','8','2015.11.25'),
('10','4','2015.11.9'),
('11','4','2015.11.15'),
('2','3','2015.11.25');

insert into
registerings(idabonement,datereg,idtimetable,isVisit) values
('1','2015.12.23','5','нет'),
('2','2015.12.23','5','нет'),
('3','2015.12.23','5','нет'),
('5','2015.12.23','5','нет'),
('1','2015.11.30','2','нет'),
('2','2015.11.30','2','нет'),
('1','2015.11.30','1','нет'),
('6','2015.11.30','5','нет'),
('7','2015.12.30','8','нет');


